docs/journal/2024/06/15/2024-06-15.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-06-29 Sat 09:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="John Kitchin" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7d094c1">1. Using joblib in an eln for cache</a>
<ul>
<li><a href="#org9ba8aaf">1.1. Finding what we have done</a></li>
<li><a href="#orgefcfee5">1.2. limitations</a>
<ul>
<li><a href="#orgd73e8db">1.2.1. Running in different ways leads to running multiple times</a></li>
<li><a href="#org9fd5827">1.2.2. internal changes to functions don't invalidate the cache</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org7d094c1" class="outline-2">
<h2 id="org7d094c1"><span class="section-number-2">1.</span> Using joblib in an eln for cache</h2>
<div class="outline-text-2" id="text-1">
<p>
We explore using joblib to cache results for reuse.
</p>

<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #0000FF;">from</span> joblib <span style="color: #0000FF;">import</span> Memory
<span style="color: #BA36A5;">mem</span> = Memory(<span style="color: #008000;">'.'</span>)

<span style="color: #0000FF;">from</span> scipy.integrate <span style="color: #0000FF;">import</span> solve_ivp
<span style="color: #0000FF;">import</span> nava

<span style="color: #6434A3;">@mem.cache</span>
<span style="color: #0000FF;">def</span> <span style="color: #006699;">solution</span>(k):
    <span style="color: #036A07;">'''Get solution for k.'''</span>
    <span style="color: #BA36A5;">nu</span> = 1
    <span style="color: #BA36A5;">Vspan</span> = (0, 2)
    <span style="color: #BA36A5;">Fa0</span> = 1

    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">define the ODE</span>
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">ode</span>(V, Fa, k):
        <span style="color: #0000FF;">return</span> -k * Fa / nu

    <span style="color: #BA36A5;">sol</span> = solve_ivp(ode, Vspan, (Fa0,), args=(k,))
    nava.play(<span style="color: #008000;">'../../../../cash-register-fake-88639.mp3'</span>)
    <span style="color: #0000FF;">return</span> sol

</pre>
</div>

<div class="org-src-container">
<pre class="src src-jupyter-python">solution(0.1)
</pre>
</div>

<pre class="example">
________________________________________________________________________________
[Memory] Calling __main__--var-folders-3q-ht_2mtk52hl7ydxrcr87z2gr0000gn-T-ipykernel-3623200184.solution...
solution(0.1)
_________________________________________________________solution - 3.4s, 0.1min
</pre>

<pre class="example" id="org7ec76c0">
  message: The solver successfully reached the end of the integration interval.
  success: True
   status: 0
        t: [ 0.000e+00  1.585e-01  1.744e+00  2.000e+00]
        y: [[ 1.000e+00  9.843e-01  8.400e-01  8.187e-01]]
      sol: None
 t_events: None
 y_events: None
     nfev: 20
     njev: 0
      nlu: 0
</pre>

<div class="org-src-container">
<pre class="src src-jupyter-python">solution(0.1)
</pre>
</div>

<pre class="example" id="org5a01855">
  message: The solver successfully reached the end of the integration interval.
  success: True
   status: 0
        t: [ 0.000e+00  1.585e-01  1.744e+00  2.000e+00]
        y: [[ 1.000e+00  9.843e-01  8.400e-01  8.187e-01]]
      sol: None
 t_events: None
 y_events: None
     nfev: 20
     njev: 0
      nlu: 0
</pre>

<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #BA36A5;">K</span> = [0.1, 0.2, 0.4]
<span style="color: #BA36A5;">SOL</span> = [solution(k) <span style="color: #0000FF;">for</span> k <span style="color: #0000FF;">in</span> K]
</pre>
</div>

<pre class="example">
________________________________________________________________________________
[Memory] Calling __main__--var-folders-3q-ht_2mtk52hl7ydxrcr87z2gr0000gn-T-ipykernel-2224898908.solution...
solution(0.2)
_________________________________________________________solution - 3.4s, 0.1min
________________________________________________________________________________
[Memory] Calling __main__--var-folders-3q-ht_2mtk52hl7ydxrcr87z2gr0000gn-T-ipykernel-2224898908.solution...
solution(0.4)
_________________________________________________________solution - 3.2s, 0.1min
</pre>


<div class="org-src-container">
<pre class="src src-jupyter-python">[sol.y[0][-1] <span style="color: #0000FF;">for</span> sol <span style="color: #0000FF;">in</span> SOL]
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">0.8187307577762143</td>
<td class="org-right">0.6703201753500971</td>
<td class="org-right">0.4493323314834313</td>
</tr>
</tbody>
</table>
</div>
<div id="outline-container-org9ba8aaf" class="outline-3">
<h3 id="org9ba8aaf"><span class="section-number-3">1.1.</span> Finding what we have done</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-sh">find joblib -name metadata.json
</pre>
</div>


<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #0000FF;">import</span> glob
<span style="color: #0000FF;">import</span> json
<span style="color: #0000FF;">import</span> pickle
<span style="color: #0000FF;">from</span> pathlib <span style="color: #0000FF;">import</span> Path
<span style="color: #0000FF;">import</span> joblib

<span style="color: #0000FF;">for</span> f <span style="color: #0000FF;">in</span> glob.glob(<span style="color: #008000;">'joblib/**/metadata.json'</span>,
          recursive=<span style="color: #D0372D;">True</span>):
    <span style="color: #0000FF;">with</span> <span style="color: #006FE0;">open</span>(f) <span style="color: #0000FF;">as</span> _f:
        <span style="color: #BA36A5;">data</span> = json.loads(_f.read())
        <span style="color: #0000FF;">if</span> data[<span style="color: #008000;">'input_args'</span>] == {<span style="color: #008000;">'k'</span>: <span style="color: #008000;">'0.4'</span>}:
            <span style="color: #BA36A5;">pkl</span> = Path(f).parent / <span style="color: #008000;">'output.pkl'</span>
            <span style="color: #006FE0;">print</span>(joblib.load(pkl))
</pre>
</div>

<pre class="example" id="org7ec47d0">
  message: The solver successfully reached the end of the integration interval.
  success: True
   status: 0
        t: [ 0.000e+00  1.201e-01  1.322e+00  2.000e+00]
        y: [[ 1.000e+00  9.531e-01  5.894e-01  4.493e-01]]
      sol: None
 t_events: None
 y_events: None
     nfev: 20
     njev: 0
      nlu: 0
</pre>


<p>
With joblib:
</p>
<ul class="org-ul">
<li>Somewhat findable</li>
<li>definitely reusable</li>
<li>not interoperable</li>
<li>locally accessible</li>
</ul>

<p>
Many other good ideas: hash, json data storage
</p>
</div>
</div>
<div id="outline-container-orgefcfee5" class="outline-3">
<h3 id="orgefcfee5"><span class="section-number-3">1.2.</span> limitations</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgd73e8db" class="outline-4">
<h4 id="orgd73e8db"><span class="section-number-4">1.2.1.</span> Running in different ways leads to running multiple times</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">from</span> joblib <span style="color: #0000FF;">import</span> Memory
<span style="color: #BA36A5;">mem</span> = Memory(<span style="color: #008000;">'.'</span>)

<span style="color: #0000FF;">from</span> scipy.integrate <span style="color: #0000FF;">import</span> solve_ivp
<span style="color: #0000FF;">import</span> nava

<span style="color: #6434A3;">@mem.cache</span>
<span style="color: #0000FF;">def</span> <span style="color: #006699;">solution</span>(k):
    <span style="color: #BA36A5;">nu</span> = 1
    <span style="color: #BA36A5;">Vspan</span> = (0, 2)
    <span style="color: #BA36A5;">Fa0</span> = 1

    <span style="color: #0000FF;">def</span> <span style="color: #006699;">ode</span>(V, Fa, k):
        <span style="color: #0000FF;">return</span> -k * Fa / nu

    <span style="color: #BA36A5;">sol</span> = solve_ivp(ode, Vspan, (Fa0,), args=(k,))
    nava.play(<span style="color: #008000;">'../../../../cash-register-fake-88639.mp3'</span>)
    <span style="color: #0000FF;">return</span> sol

<span style="color: #0000FF;">return</span> solution(0.1)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">from</span> joblib <span style="color: #0000FF;">import</span> Memory
<span style="color: #BA36A5;">mem</span> = Memory(<span style="color: #008000;">'.'</span>)

<span style="color: #0000FF;">from</span> scipy.integrate <span style="color: #0000FF;">import</span> solve_ivp
<span style="color: #0000FF;">import</span> nava

<span style="color: #6434A3;">@mem.cache</span>
<span style="color: #0000FF;">def</span> <span style="color: #006699;">solution</span>(k):
    <span style="color: #BA36A5;">nu</span> = 1
    <span style="color: #BA36A5;">Vspan</span> = (0, 2)
    <span style="color: #BA36A5;">Fa0</span> = 1

    <span style="color: #0000FF;">def</span> <span style="color: #006699;">ode</span>(V, Fa, k):
        <span style="color: #0000FF;">return</span> -k * Fa / nu

    <span style="color: #BA36A5;">sol</span> = solve_ivp(ode, Vspan, (Fa0,), args=(k,))
    nava.play(<span style="color: #008000;">'../../../../cash-register-fake-88639.mp3'</span>)
    <span style="color: #0000FF;">return</span> sol

<span style="color: #006FE0;">print</span>(solution(0.1))
</pre>
</div>


<div class="org-src-container">
<pre class="src src-sh">python solution.py
</pre>
</div>
</div>
</div>
<div id="outline-container-org9fd5827" class="outline-4">
<h4 id="org9fd5827"><span class="section-number-4">1.2.2.</span> internal changes to functions don't invalidate the cache</h4>
<div class="outline-text-4" id="text-1-2-2">
<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #0000FF;">def</span> <span style="color: #006699;">f</span>(x):
    <span style="color: #0000FF;">return</span> 40 * x
</pre>
</div>

<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #6434A3;">@mem.cache</span>
<span style="color: #0000FF;">def</span> <span style="color: #006699;">g</span>(x):
    nava.play(<span style="color: #008000;">'../../../../cash-register-fake-88639.mp3'</span>)
    <span style="color: #0000FF;">return</span> f(x)**2
</pre>
</div>

<div class="org-src-container">
<pre class="src src-jupyter-python">g(1)
</pre>
</div>

<pre class="example">
16
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Kitchin</p>
<p class="date">Created: 2024-06-29 Sat 09:23</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
